In [19]:
import pandas as pd
import numpy as np

In [20]:
from numpy.random import randn
np.random.seed(100)

In [21]:
pd.DataFrame?

In [36]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [37]:
df

          W         X         Y         Z
A  1.618982  1.541605 -0.251879 -0.842436
B  0.184519  0.937082  0.731000  1.361556
C -0.326238  0.055676  0.222400 -1.443217
D -0.756352  0.816454  0.750445 -0.455947
E  1.189622 -1.690617 -1.356399 -1.232435

In [38]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [39]:
print(df['W'],type(df['W']))

A    1.618982
B    0.184519
C   -0.326238
D   -0.756352
E    1.189622
Name: W, dtype: float64 <class 'pandas.core.series.Series'>

In [40]:
print(df['W']['A'])

1.6189816606752596

In [41]:
df['X']

A    1.541605
B    0.937082
C    0.055676
D    0.816454
E   -1.690617
Name: X, dtype: float64

In [46]:
df[['W','X']]

          W         X
A  1.618982  1.541605
B  0.184519  0.937082
C -0.326238  0.055676
D -0.756352  0.816454
E  1.189622 -1.690617

In [47]:
df.W

A    1.618982
B    0.184519
C   -0.326238
D   -0.756352
E    1.189622
Name: W, dtype: float64

In [50]:
df['F']=df['X']+df['Y']

In [51]:
df

          W         X         Y         Z       new         F
A  1.618982  1.541605 -0.251879 -0.842436  1.289726  1.289726
B  0.184519  0.937082  0.731000  1.361556  1.668083  1.668083
C -0.326238  0.055676  0.222400 -1.443217  0.278076  0.278076
D -0.756352  0.816454  0.750445 -0.455947  1.566899  1.566899
E  1.189622 -1.690617 -1.356399 -1.232435 -3.047016 -3.047016

In [56]:
df.drop('F',axis=1,inplace=True)

In [57]:
df

          W         X         Y         Z       new
A  1.618982  1.541605 -0.251879 -0.842436  1.289726
B  0.184519  0.937082  0.731000  1.361556  1.668083
C -0.326238  0.055676  0.222400 -1.443217  0.278076
D -0.756352  0.816454  0.750445 -0.455947  1.566899
E  1.189622 -1.690617 -1.356399 -1.232435 -3.047016

In [58]:
df.drop('new',axis=1)

          W         X         Y         Z
A  1.618982  1.541605 -0.251879 -0.842436
B  0.184519  0.937082  0.731000  1.361556
C -0.326238  0.055676  0.222400 -1.443217
D -0.756352  0.816454  0.750445 -0.455947
E  1.189622 -1.690617 -1.356399 -1.232435

In [59]:
df.loc['A']

W      1.618982
X      1.541605
Y     -0.251879
Z     -0.842436
new    1.289726
Name: A, dtype: float64

In [60]:
df.iloc[2]

W     -0.326238
X      0.055676
Y      0.222400
Z     -1.443217
new    0.278076
Name: C, dtype: float64

In [61]:
df.loc['B','X']

0.9370822011089522

In [63]:
df.loc[['A','B'],['X','Y']]

          X         Y
A  1.541605 -0.251879
B  0.937082  0.731000

In [64]:
df

          W         X         Y         Z       new
A  1.618982  1.541605 -0.251879 -0.842436  1.289726
B  0.184519  0.937082  0.731000  1.361556  1.668083
C -0.326238  0.055676  0.222400 -1.443217  0.278076
D -0.756352  0.816454  0.750445 -0.455947  1.566899
E  1.189622 -1.690617 -1.356399 -1.232435 -3.047016

In [65]:
df>0

       W      X      Y      Z    new
A   True   True  False  False   True
B   True   True   True   True   True
C  False   True   True  False   True
D  False   True   True  False   True
E   True  False  False  False  False

In [66]:
df[df>0]

          W         X         Y         Z       new
A  1.618982  1.541605       NaN       NaN  1.289726
B  0.184519  0.937082  0.731000  1.361556  1.668083
C       NaN  0.055676  0.222400       NaN  0.278076
D       NaN  0.816454  0.750445       NaN  1.566899
E  1.189622       NaN       NaN       NaN       NaN

In [67]:
df[df['X']>0]

          W         X         Y         Z       new
A  1.618982  1.541605 -0.251879 -0.842436  1.289726
B  0.184519  0.937082  0.731000  1.361556  1.668083
C -0.326238  0.055676  0.222400 -1.443217  0.278076
D -0.756352  0.816454  0.750445 -0.455947  1.566899

In [69]:
df[df['X']>0]['Y']

A   -0.251879
B    0.731000
C    0.222400
D    0.750445
Name: Y, dtype: float64

In [74]:
df[df['X']>0][['Y','Z']]

          Y         Z
A -0.251879 -0.842436
B  0.731000  1.361556
C  0.222400 -1.443217
D  0.750445 -0.455947

In [81]:
df[(df['W']>0) & (df['X']>1)]

          W         X         Y         Z       new
A  1.618982  1.541605 -0.251879 -0.842436  1.289726

In [84]:
df.drop('new',axis=1,inplace=True)

In [85]:
df

          W         X         Y         Z
A  1.618982  1.541605 -0.251879 -0.842436
B  0.184519  0.937082  0.731000  1.361556
C -0.326238  0.055676  0.222400 -1.443217
D -0.756352  0.816454  0.750445 -0.455947
E  1.189622 -1.690617 -1.356399 -1.232435

In [89]:
df.reset_index()

  index         W         X         Y         Z
0     A  1.618982  1.541605 -0.251879 -0.842436
1     B  0.184519  0.937082  0.731000  1.361556
2     C -0.326238  0.055676  0.222400 -1.443217
3     D -0.756352  0.816454  0.750445 -0.455947
4     E  1.189622 -1.690617 -1.356399 -1.232435

In [90]:
n='SI RI CH AN DA'.split()

In [91]:
df['states']=n

In [92]:
df

          W         X         Y         Z states
A  1.618982  1.541605 -0.251879 -0.842436     SI
B  0.184519  0.937082  0.731000  1.361556     RI
C -0.326238  0.055676  0.222400 -1.443217     CH
D -0.756352  0.816454  0.750445 -0.455947     AN
E  1.189622 -1.690617 -1.356399 -1.232435     DA

In [93]:
df.set_index('states')

               W         X         Y         Z
states
SI      1.618982  1.541605 -0.251879 -0.842436
RI      0.184519  0.937082  0.731000  1.361556
CH     -0.326238  0.055676  0.222400 -1.443217
AN     -0.756352  0.816454  0.750445 -0.455947
DA      1.189622 -1.690617 -1.356399 -1.232435

In [94]:
df.set_index('states',inplace=True)

In [95]:
df

               W         X         Y         Z
states
SI      1.618982  1.541605 -0.251879 -0.842436
RI      0.184519  0.937082  0.731000  1.361556
CH     -0.326238  0.055676  0.222400 -1.443217
AN     -0.756352  0.816454  0.750445 -0.455947
DA      1.189622 -1.690617 -1.356399 -1.232435